//======================================================================================//
//
//						タイトルプログラム
//
//======================================================================================//
#include		<windows.h>
#include		<stdio.h>
#include		<math.h>
#include		"MASTER/Ci-Lib.H"
#include		"Game.H"

//****************************************************************************
//	■	定義
//
//****************************************************************************



//****************************************************************************
//	■	内部使用　変数
//
//****************************************************************************
GsSOUND		TBGM;
GsSOUND		TAP;

GsTEXTURE	TitleBG;
GsTEXTURE	Rogo;
GsTEXTURE	Tap;
GsTEXTURE	En1;
GsTEXTURE	En2;

float EPx[2],EPy[2],EDx[2];
short Ro[2], RoA[2];

short XC, XA;
//--------------------------------------------------------------------------//
//	●	初期化		：シーンに移る時一回、変数の初期化 
//
//--------------------------------------------------------------------------//
void	TitleInit(void)
{
	EPx[0] = -150;
	EPx[1] = 2070;
	EPy[0] = 350;
	EPy[1] = 730;
	EDx[0] = 9.0f;
	EDx[1] = -9.0f;

	RoA[0] = 3;
	RoA[1] = -3;

	XC = 0;
	XA = 1;

	
}

//--------------------------------------------------------------------------//
//	●	内部処理	：シーン中の処理、現在のシーンで行う処理
//
//--------------------------------------------------------------------------//
void	TitleLoop(void)
{
	XC = XC + XA;

	if (XC <= 1 && XC >= 1) {
		Gs_PlayBGM(TBGM);
	}

	if (XC >= 2) {
		XC = 0;
		XA = 0;

	}

	EPx[0] = EPx[0] + EDx[0];
	EPx[1] = EPx[1] + EDx[1];

	Ro[0] = Ro[0] + RoA[0];
	Ro[1] = Ro[1] + RoA[1];

	if (EPx[0] >= 2050) {
		EDx[0] = -9.0f;
		EPy[0] = 860;
	}
	if (EPx[0] <= -125) {
		EPy[0] = 350;
		EDx[0] = 9.0f;
	}

	if (EPx[1] >= 2070) {
		EDx[1] = -9.0f;
		EPy[1] = 730;
	}

	if (EPx[1] <= -150) {
		EDx[1] = 9.0f;
		EPy[1] = 350;
	}

	if (Mouse.Trg &_lMOUSE) {
		Gs_PlaySE(TAP);
		SceneChange(SELECT_SCENE);

	}
}

//--------------------------------------------------------------------------//
//	●	描画		：シーン中の描画、現在のシーンで表示するBMPはここで
//
//--------------------------------------------------------------------------//
void	TitleDraw(void)
{
	Gs_DrawLayer(940, 540, TitleBG, 0, 0, 1920, 1080, OFF, ARGB(254, 255, 255, 254), ON, 0, 1.0f, 1.0f);
	Gs_DrawLayer(EPx[0], EPy[0], En1, 0, 0, 300, 302, OFF, ARGB(254, 255, 255, 254), ON, Ro[0], 1.0f, 1.0f);
	Gs_DrawLayer(EPx[1], EPy[1], En2, 0, 0, 300, 302, OFF, ARGB(254, 255, 255, 254), ON, Ro[1], 1.0f, 1.0f);
	Gs_DrawLayer(960, 440, Rogo, 0, 0, 890, 512, OFF, ARGB(254, 255, 255, 254), ON, 0, 1.0f, 1.0f);
	Gs_DrawLayer(960, 850, Tap, 0, 0, 950, 225, OFF, ARGB(254, 255, 255, 254), ON, 0, 1.0f, 0.5f);

}

//--------------------------------------------------------------------------//
//	●	ロード		：シーンに入る時、そのシーンで必要なデータの読み込み
//
//--------------------------------------------------------------------------//
short	TitleLoad(void)
{
	TitleBG = Gs_LoadBMP("DATA/BMP/タイトル/背景.PNG");
	Rogo = Gs_LoadBMP("DATA/BMP/タイトル/タイトルロゴ.PNG");
	Tap = Gs_LoadBMP("DATA/BMP/タイトル/PRESS_START.PNG");
	En1 = Gs_LoadBMP("DATA/BMP/タイトル/流れる野菜.PNG");
	En2 = Gs_LoadBMP("DATA/BMP/タイトル/流れる肉.PNG");

	TBGM = Gs_LoadWAVE("DATA/SOUND/タイトル/タイトルBGM.WAV", ON);
	TAP = Gs_LoadWAVE("DATA/SOUND/タップ音.WAV", OFF);

	return		TITLE_SCENE;
}

//--------------------------------------------------------------------------//
//	●	後処理		：現在のシーンから抜ける時、データの破棄
//
//--------------------------------------------------------------------------//
void	TitleExit(void)
{
	Gs_ReleaseBMP(TitleBG);
	Gs_ReleaseBMP(Rogo);
	Gs_ReleaseBMP(Tap);
	Gs_ReleaseBMP(En1);
	Gs_ReleaseBMP(En2);

	Gs_ReleaseSOUND(TBGM);
	Gs_ReleaseSOUND(TAP);

}

//****************************************************************************
//	★　シーンテーブル：各シーンで呼び出される関数の登録
//****************************************************************************

SCENE_TBL	TitleSceneTbl = {
	TitleLoad,
	TitleInit,
	TitleLoop,
	TitleDraw,
	TitleExit
};

//======================================================================================//
//							EOP															//
//======================================================================================//
